src/cf/InformationRegisters/инт_ОчередьИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>инт_ОчередьИсходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИсходныеДанные</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.инт_ИсходныеДанные</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СформированноеСообщение</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПотокДанных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_ПотокиДанных</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/инт_СпособыПередачиПараметровПоHTTP.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>инт_СпособыПередачиПараметровПоHTTP</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВЗаголовке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПараметреПути</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВПараметреЗапроса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/инт_Подписчики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>инт_Подписчики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СпособПередачиИдентификатораСообщения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СпособыПередачиПараметровПоHTTP</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПередачиИдентификатораПотока</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_СпособыПередачиПараметровПоHTTP</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодписчика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.инт_ТипыПодписчиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопытокОтправки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаСервис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.инт_Эндпоинты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Активен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаузаМеждуПопыткамиОбработки</Name>
					<Comment>Пауза между попытками обработки в секундах.(0 - сообщение будет обработано повторно как можно быстрее)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяТопика</Name>
					<Comment>Имя топика kafka</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПакетнаяОбработка</Name>
					<Comment>Сообщения будут отправлены не сразу, а перед завершением обработки потока одним пакетом</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПостПроцессинг</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КодСостояния</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обработчик</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/инт_РаботаССообщениямиПроизвольныйHTTP/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////
// Модуль: инт_РаботаССообщениямиПроизвольныйHTTP
//
// Описание:
//  Модуль для работы с подписчиками типа "Произвольный HTTP".
//  Реализует формирование и отправку HTTP-запросов с гибкой настройкой параметров.
//
// Основные возможности:
//  - Сериализация сообщений в формат JSON
//  - Отправка POST-запросов с настраиваемыми параметрами
//  - Передача идентификаторов потока и сообщения различными способами:
//    * В параметрах пути URL (например: /api/{flow_id}/messages/{message_id})
//    * В заголовках HTTP (например: X-Flow-Id, X-Message-Id)
//    * В параметрах запроса (query string, например: ?flow_id=xxx&message_id=yyy)
//  - Выполнение пост-обработки ответов от подписчиков
//
// Использование:
//  Подходит для интеграции с REST API внешних систем, где требуется
//  гибкая настройка параметров HTTP-запроса.
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Функция - Сформировать сообщение по подписчику
//
// Параметры:
//  ДанныеСообщения     -   Соответствие   - Соттветствие содержащее данные для сериатизации
//  Подписчик         -  СпраочникСсылка.инт_Подписчики    - ссылка на подписчика.
// 
// Возвращаемое значение:
//  Строка - Сериализованное, котовое к отправке подписчику сообщение
//
Функция СформироватьСообщениеПоПодписчику(ДанныеСообщения, Подписчик) Экспорт
    // Пока так. 
    // В теории тут могут быть манипуляции с сообщением. 
	// Сериализация в xml, подсовывание других параметров сериализации(не знаю, форматы дат-там другие и тд)
    // но пока просто в json для mvp
    Возврат инт_КоннекторHTTP.ОбъектВJson(ДанныеСообщения);
		
КонецФункции

// Процедура - Отправить сообщение подписчику
//
// Параметры:
//  Сообщение     - Структура - Данные сообщения 
//
Процедура ОтправитьСообщение(Сообщение) Экспорт
	ДанныеИсходящегоСообщения = РегистрыСведений.инт_ОчередьИсходящихСообщений.ПолучитьДанныеОчередиПоИдентификатору(
																						Сообщение.ИдентификаторСообщения,
																						"ПотокДанных, ИдентификаторСообщения, ИсходныеДанные");
	Подписчик = Сообщение.Подписчик;
	СтруктураПараметровСоединения = Справочники.инт_Эндпоинты.СтруктураПараметровСоединения(Подписчик.СсылкаНаСервис);

	url = СформироватьURLПоДаннымПодписчика(СтруктураПараметровСоединения.АдресРесурса,
												Подписчик, ДанныеИсходящегоСообщения);
	Заголовки = СформироватьЗаголовкиПоДаннымПодписчика(Подписчик, ДанныеИсходящегоСообщения);
	ПараметрыЗапроса = СформироватьПараметрыЗапросаПоДаннымПодписчика(Подписчик, ДанныеИсходящегоСообщения);
	
	ДополнительныеПараметры = Новый Структура("Заголовки, ПараметрыЗапроса", Заголовки, ПараметрыЗапроса);
	
	Ответ = инт_КоннекторHTTP.Post(url, Сообщение.СформированноеСообщение,
																ДополнительныеПараметры,
																СтруктураПараметровСоединения.Сессия);
	
	Справочники.инт_Подписчики.ВыполнитьПостОбработку(Подписчик, Ответ, ДанныеИсходящегоСообщения.ИсходныеДанные);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция - Сформировать URL по данным подписчика
//
// Параметры:
//  url                       - Строка                              - Базовый URL сервиса подписчика
//  Подписчик                 - СправочникСсылка.инт_Подписчики     - Ссылка на подписчика
//  ДанныеИсходящегоСообщения - Структура                           - Данные исходящего сообщения
//
// Возвращаемое значение:
//  Строка - Сформированный URL с подставленными параметрами пути
//
// Описание:
//  Формирует итоговый URL для отправки сообщения, подставляя в шаблон URL
//  идентификаторы потока и сообщения, если настроена передача в параметрах пути.
//  Поддерживаемые макросы: {flow_id}, {message_id}
//
Функция СформироватьURLПоДаннымПодписчика(Знач url, // BSLLS:LatinAndCyrillicSymbolInWord-off
											Подписчик,
											ДанныеИсходящегоСообщения)
	Если НЕ ЗначениеЗаполнено(url) Тогда
		ВызватьИсключение СтрШаблон("Не заполнена ссылка на сервис для подписчика <%1>", Подписчик);
	КонецЕсли;
	
	Если Подписчик.СпособПередачиИдентификатораПотока =
			Перечисления.инт_СпособыПередачиПараметровПоHTTP.ВПараметреПути Тогда
		url = СтрЗаменить(URL, "{flow_id}", ДанныеИсходящегоСообщения.ПотокДанных.Код);
	КонецЕсли;
	
	Если Подписчик.СпособПередачиИдентификатораСообщения =
			Перечисления.инт_СпособыПередачиПараметровПоHTTP.ВПараметреПути Тогда
		url = СтрЗаменить(URL, "{message_id}", ДанныеИсходящегоСообщения.ИдентификаторСообщения);
	КонецЕсли;
	
	Возврат url;
КонецФункции

// Функция - Сформировать заголовки по данным подписчика
//
// Параметры:
//  Подписчик                 - СправочникСсылка.инт_Подписчики - Ссылка на подписчика
//  ДанныеИсходящегоСообщения - Структура                       - Данные исходящего сообщения
//
// Возвращаемое значение:
//  Соответствие - Заголовки HTTP-запроса (ключ - имя заголовка, значение - значение заголовка)
//
// Описание:
//  Формирует заголовки HTTP-запроса, добавляя идентификаторы потока и сообщения
//  в заголовки "flow_id" и "message_id", если настроена передача в заголовках.
//
Функция СформироватьЗаголовкиПоДаннымПодписчика(Подписчик, ДанныеИсходящегоСообщения)
	Заголовки = Новый Соответствие;
	
	Если Подписчик.СпособПередачиИдентификатораПотока =
			Перечисления.инт_СпособыПередачиПараметровПоHTTP.ВЗаголовке Тогда
		Заголовки.Вставить("flow_id", ДанныеИсходящегоСообщения.ПотокДанных.Код);
	КонецЕсли;
	
	Если Подписчик.СпособПередачиИдентификатораСообщения =
			Перечисления.инт_СпособыПередачиПараметровПоHTTP.ВЗаголовке Тогда
		Заголовки.Вставить("message_id", ДанныеИсходящегоСообщения.ИдентификаторСообщения);
	КонецЕсли;
	
	Возврат Заголовки;
	
КонецФункции

// Функция - Сформировать параметры запроса по данным подписчика
//
// Параметры:
//  Подписчик                 - СправочникСсылка.инт_Подписчики - Ссылка на подписчика
//  ДанныеИсходящегоСообщения - Структура                       - Данные исходящего сообщения
//
// Возвращаемое значение:
//  Структура - Параметры запроса (query string параметры)
//
// Описание:
//  Формирует параметры запроса (query string), добавляя идентификаторы потока
//  и сообщения в параметры "flow_id" и "message_id", если настроена передача в параметрах запроса.
//
 Функция СформироватьПараметрыЗапросаПоДаннымПодписчика(Подписчик, ДанныеИсходящегоСообщения)
	ПараметрыЗапроса = Новый Структура;
	
	Если Подписчик.СпособПередачиИдентификатораПотока =
			Перечисления.инт_СпособыПередачиПараметровПоHTTP.ВПараметреЗапроса Тогда
		ПараметрыЗапроса.Вставить("flow_id", ДанныеИсходящегоСообщения.ПотокДанных.Код);
	КонецЕсли;
	
	Если Подписчик.СпособПередачиИдентификатораСообщения =
			Перечисления.инт_СпособыПередачиПараметровПоHTTP.ВПараметреЗапроса Тогда
		ПараметрыЗапроса.Вставить("message_id", ДанныеИсходящегоСообщения.ИдентификаторСообщения);
	КонецЕсли;
	
	Возврат ПараметрыЗапроса;
	
КонецФункции
#КонецОбласти
